# context = {
    
# }
QUESTION_TYPES = {
    "单选题": {
        "desc_for_llm": "单选题有四个选项ABCD，参考答案为其中一个选项"
    },
    "多选题": {
        "desc_for_llm": "多选题有四个选项ABCD，参考答案为其中二到四个选项，一般答案为二或者三个选项居多"
    },
    "大题": {
        "desc_for_llm": "大题中若有多道小题，参考答案需要一道道针对性给答案，并且每题要逐步增加难度，从识记到应用，同时在思考时每小题需要给出涉及的具体课本知识点。\n政治大题和历史大题多为直接给出若干个材料，然后给出若干道需要根据材料回答的小题，小题答案需要涉及课本内容和结合课外内容；生物大题多为在课外内容背景下对课内知识的考查，多为填空题，也可以有小题，填空用___下划线表示需要填空的地方；地理大题多为在课外内容背景下对课内知识的考查，答案需结合课本内容和课外内容，多为小题"
    }
}

TEAM_MEMBER_CONFIGRATIONS = {
    "rag_er": {
        "desc_for_llm": "从现有学科知识库中检索相关课内知识，并且根据这些知识生成一道简单的面向课本知识的题目。"
    },
    # "browser_generator": {
    #     "desc_for_llm": "使用搜索引擎和web crawlers在互联网收集知识库中没有的课内知识并且根据这些信息生成一道简单或中等难度偏上面向课本知识的题目"
    # },
    "rag_and_browser": {
        "desc_for_llm": "从现有学科知识库中检索相关课内知识，并且使用搜索引擎和web crawlers在互联网收集课外知识，并且根据这些信息生成一道中等难度偏上的深度结合课本知识和课外知识的题目"
    },
    "reporter": {
        "desc_for_llm": "根据每个步骤的结果整合和撰写专业报告。"
    }
}

TEAM_MEMBERS = list(TEAM_MEMBER_CONFIGRATIONS.keys())

